/************************************************************
 * 版权：2025CIMC Copyright。 
 * 文件：adc.h
 * 作者: Lingyu Meng
 * 平台: 2025CIMC IHD-V04
 * 版本: Lingyu Meng     2025/03/07     V0.01    original
************************************************************/

#ifndef __ADC_H
#define __ADC_H

/************************* 头文件 *************************/

#include "HeaderFiles.h"

/************************* 宏定义 *************************/


/************************ 变量定义 ************************/


/************************ 函数定义 ************************/

void ADC_port_init(void); //adc端口初始化
void ADC_Init(void);     //  ADC 初始化
// 读取 PC0（滑动变阻器）电压
float ADC_Read_CH0_Voltage(void);
// 读取 PC1（DAC回读）电压
float ADC_Read_DAC_Readback_Voltage(void);				    
#endif


/****************************End*****************************/

